---
kind: property
id: P:Autodesk.Revit.Attributes.RegenerationAttribute.Option
source: html/780f58a7-c4b1-0958-19a4-37f74f7b5f76.htm
---
# Autodesk.Revit.Attributes.RegenerationAttribute.Option Property

Regeneration option.

## Syntax (C#)
```csharp
public RegenerationOption Option { get; }
```